src/test/resources/PullMessageRespone2.xml

<!--   
captured from wireshark after application sent a pull request after I waved at thecamera
- but the code did not see a 

POST /onvif/device_service HTTP/1.1
Content-Type: text/xml;charset=UTF-8
Accept: */*
User-Agent: Java/21
Host: 192.168.10.109
Connection: keep-alive
Content-Length: 255

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/events/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:PullMessages>
        
      </wsdl:PullMessages>
   </soap:Body>
</soap:Envelope>
HTTP/1.0 200 OK
Content-Type: application/soap+xml; charset=utf-8
Content-Length: 1551
Connection: close


-->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:tns1="http://www.onvif.org/ver10/topics">
<SOAP-ENV:Header>
<wsa5:Action>http://www.onvif.org/ver10/events/wsdl/PullPointSubscription/PullMessagesResponse</wsa5:Action>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<tev:PullMessagesResponse>
<tev:CurrentTime>2026-02-19T02:27:29Z</tev:CurrentTime>
<tev:TerminationTime>2026-02-19T02:32:29Z</tev:TerminationTime>
<wsnt:NotificationMessage>
<wsnt:Topic Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">tns1:RuleEngine/CellMotionDetector/Motion</wsnt:Topic>
<wsnt:Message>
<tt:Message UtcTime="2026-02-19T02:27:29Z" PropertyOperation="Changed">
<tt:Source>
<tt:SimpleItem Name="VideoSourceConfigurationToken" Value="videoSourceToken" />
<tt:SimpleItem Name="VideoAnalyticsConfigurationToken" Value="VideoAnalyticsToken" />
<tt:SimpleItem Name="Rule" Value="MyMotionDetectorRule" />
</tt:Source>
<tt:Data>
<tt:SimpleItem Name="IsMotion" Value="true" />
</tt:Data>
</tt:Message>
</wsnt:Message>
</wsnt:NotificationMessage>
</tev:PullMessagesResponse>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
